# MONARCH MIGRATION 1994 - 2001

In [22]:
import pandas as pd
import sqlite3
import os

In [23]:
db = sqlite3.connect("Monarchs.db")

### Read CSV for each year

In [24]:
monarchs2001 = pd.read_pickle("Data\Monarchs2001.pkl")
monarchs2000 = pd.read_pickle("Data\Monarchs2000.pkl")
monarchs1999 = pd.read_pickle("Data\Monarchs1999.pkl")
monarchs1998 = pd.read_pickle("Data\Monarchs1998.pkl")
monarchs1997 = pd.read_pickle("Data\Monarchs1997.pkl")
monarchs1996 = pd.read_pickle("Data\Monarchs1996.pkl")
monarchs1995 = pd.read_pickle("Data\Monarchs1995.pkl")
monarchs1994 = pd.read_pickle("Data\Monarchs1994.pkl")

### Convert pandas to SQL table

In [25]:
monarchs2001.to_sql("Monarchs2001", db, if_exists="replace")
monarchs2000.to_sql("monarchs2000", db, if_exists="replace")
monarchs1999.to_sql("monarchs1999", db, if_exists="replace")
monarchs1998.to_sql("monarchs1998", db, if_exists="replace")
monarchs1997.to_sql("monarchs1997", db, if_exists="replace")
monarchs1996.to_sql("monarchs1996", db, if_exists="replace")
monarchs1995.to_sql("monarchs1995", db, if_exists="replace")
monarchs1994.to_sql("monarchs1994", db, if_exists="replace")

os.getcwd()

C:\Users\Arink\Anaconda3\lib\site-packages\pandas\core\generic.py:2712: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

'C:\\Users\\Arink\\Desktop\\github\\CodeLou\\Monarchs'

### View Schema 
##### All CSVs have same columns (Previously cleaned in DATA folder)

In [26]:
data_type = pd.read_sql('SELECT * FROM PRAGMA_TABLE_INFO("monarchs2001")', db)
data_type

   cid            name       type  notnull dflt_value  pk
0    0           index    INTEGER        0       None   0
1    1         Tag No.       TEXT        0       None   0
2    2       Tag State       TEXT        0       None   0
3    3        Tag Date  TIMESTAMP        0       None   0
4    4    Report State       TEXT        0       None   0
5    5  Report Country       TEXT        0       None   0
6    6     Report Date  TIMESTAMP        0       None   0
7    7           Miles       REAL        0       None   0

### Combine all years

In [27]:
combine =  pd.concat([monarchs2001, monarchs2000, monarchs1999, monarchs1998, monarchs1997, monarchs1996, monarchs1995, monarchs1994], axis =0)
#combine.columns = ["tag_no", "tag_state", "tag_date","report_state", "report_country", "report_date", "miles"]
#combine["Tag Date"] = combine["Tag Date"].astype(str)
combine.to_sql("combine", db, if_exists="replace")
combine.dtypes

Tag No.                   object
Tag State                 object
Tag Date          datetime64[ns]
Report State              object
Report Country            object
Report Date       datetime64[ns]
Miles                     object
dtype: object

In [30]:
state_tally = pd.read_sql('SELECT `Tag State`, COUNT(*) AS "Recovered Tags" FROM monarchs1999 GROUP BY `Tag State` ORDER BY `Tag State`', db)
#state_tally = pd.read_sql('SELECT `Report State`, COUNT(*) AS "Recovered Tags" FROM monarchs1999 GROUP BY `Report State` ORDER BY `Report State`', db)
state_tally

   Tag State  Recovered Tags
0       None               5
1         AR              16
2         CO               3
3         CT               6
4         FL               2
5         IA             107
6         IL              25
7         IN              19
8         KS             140
9         KY               3
10        MA               7
11        MD               4
12        ME               2
13        MI              19
14        MN             107
15        MO               9
16        MS               2
17        MX              14
18        NC               5
19        ND               4
20        NE              18
21        NH               1
22        NJ               5
23        NY              16
24        OH              11
25        OK              20
26   Ontario              17
27        PA              18
28    Quebec               3
29        SC               2
30        SD              23
31        TX              78
32        VA               8
33        VT               2
34        WI              26
35        WV               4